app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT "users".* FROM "users"

    def set_user
      @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 ORDER BY "users"."id" ASC LIMIT 1